IDEA Open Model
ResultOfInternalForces.Mx Property
 Bending moment around x-axis
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public double Mx { get; set; }
Public Property Mx As Double
	Get
	Set
public:
property double Mx {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
ResultOfInternalForces Class
IdeaRS.OpenModel.Result Namespace